Revit 2024 API
FabricationPartRouteEnd.Dispose Method
Releases all resources used by the FabricationPartRouteEnd
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
FabricationPartRouteEnd Class
Autodesk.Revit.DB.Fabrication Namespace